In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [5]:
data = pd.Series(np.random.uniform(size=9),
                index=[["a", "a", "a", "b", "b", "c", "c", "d", "d"],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    0.953787
   2    0.995270
   3    0.170527
b  1    0.642122
   3    0.820018
c  1    0.621490
   2    0.099567
d  2    0.360726
   3    0.089622
dtype: float64

In [7]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [18]:
data.loc[:,2]

a    0.995270
c    0.099567
d    0.360726
dtype: float64

In [23]:
data.unstack()

          1         2         3
a  0.953787  0.995270  0.170527
b  0.642122       NaN  0.820018
c  0.621490  0.099567       NaN
d       NaN  0.360726  0.089622

In [25]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                    index=[["a", "a", "b", "b"], [1, 2, 1, 2]],
                    columns=[["Ohio", "Ohio", "Colorado"],
                    ["Green", "Red", "Green"]])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [29]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']

In [32]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [34]:
frame.index.nlevels

2

In [36]:
frame.columns.nlevels

2

In [38]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [40]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [45]:
frame
frame.groupby(level='key2').sum()

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [48]:
frame = pd.DataFrame({"a": range(7), "b": range(7, 0, -1),
                    "c": ["one", "one", "one", "two", "two",
                    "two", "two"],
                    "d": [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [69]:
frame2 = frame.set_index(['a','c'])
frame2.reset_index()

   a    c  b  d
0  0  one  7  0
1  1  one  6  1
2  2  one  5  2
3  3  two  4  0
4  4  two  3  1
5  5  two  2  2
6  6  two  1  3